MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV56F1M0VLL24/mcu.h
/*! @name SEL4 - Crossbar A Select Register 4 */
/*! @{ */
#define XBARA_SEL4_SEL8_MASK                     (0x3FU)
#define XBARA_SEL4_SEL8_SHIFT                    (0U)
/*! SEL8
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL4_SEL8(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL4_SEL8_SHIFT)) & XBARA_SEL4_SEL8_MASK)
#define XBARA_SEL4_SEL9_MASK                     (0x3F00U)
#define XBARA_SEL4_SEL9_SHIFT                    (8U)
/*! SEL9
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL4_SEL9(x)                       (((uint16_t)(((uint16_t)(x)) << XBARA_SEL4_SEL9_SHIFT)) & XBARA_SEL4_SEL9_MASK)
/*! @} */

/*! @name SEL5 - Crossbar A Select Register 5 */
/*! @{ */
#define XBARA_SEL5_SEL10_MASK                    (0x3FU)
#define XBARA_SEL5_SEL10_SHIFT                   (0U)
/*! SEL10
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL5_SEL10_SHIFT)) & XBARA_SEL5_SEL10_MASK)
#define XBARA_SEL5_SEL11_MASK                    (0x3F00U)
#define XBARA_SEL5_SEL11_SHIFT                   (8U)
/*! SEL11
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL5_SEL11_SHIFT)) & XBARA_SEL5_SEL11_MASK)
/*! @} */

/*! @name SEL6 - Crossbar A Select Register 6 */
/*! @{ */
#define XBARA_SEL6_SEL12_MASK                    (0x3FU)
#define XBARA_SEL6_SEL12_SHIFT                   (0U)
/*! SEL12
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL6_SEL12_SHIFT)) & XBARA_SEL6_SEL12_MASK)
#define XBARA_SEL6_SEL13_MASK                    (0x3F00U)
#define XBARA_SEL6_SEL13_SHIFT                   (8U)
/*! SEL13
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL6_SEL13(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL6_SEL13_SHIFT)) & XBARA_SEL6_SEL13_MASK)
/*! @} */

/*! @name SEL7 - Crossbar A Select Register 7 */
/*! @{ */
#define XBARA_SEL7_SEL14_MASK                    (0x3FU)
#define XBARA_SEL7_SEL14_SHIFT                   (0U)
#define XBARA_SEL7_SEL14(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL7_SEL14_SHIFT)) & XBARA_SEL7_SEL14_MASK)
#define XBARA_SEL7_SEL15_MASK                    (0x3F00U)
#define XBARA_SEL7_SEL15_SHIFT                   (8U)
/*! SEL15
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL7_SEL15(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL7_SEL15_SHIFT)) & XBARA_SEL7_SEL15_MASK)
/*! @} */

/*! @name SEL8 - Crossbar A Select Register 8 */
/*! @{ */
#define XBARA_SEL8_SEL16_MASK                    (0x3FU)
#define XBARA_SEL8_SEL16_SHIFT                   (0U)
/*! SEL16
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL8_SEL16(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL8_SEL16_SHIFT)) & XBARA_SEL8_SEL16_MASK)
#define XBARA_SEL8_SEL17_MASK                    (0x3F00U)
#define XBARA_SEL8_SEL17_SHIFT                   (8U)
/*! SEL17
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL8_SEL17(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_SEL8_SEL17_SHIFT)) & XBARA_SEL8_SEL17_MASK)
/*! @} */

