MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV56F1M0VLL24/mcu.h
/*! @name CTRL1 - Crossbar A Control Register 1 */
/*! @{ */
#define XBARA_CTRL1_DEN2_MASK                    (0x1U)
#define XBARA_CTRL1_DEN2_SHIFT                   (0U)
/*! DEN2 - DMA Enable for XBAR_OUT2
 *  0b0..DMA disabled
 *  0b1..DMA enabled
 */
#define XBARA_CTRL1_DEN2(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_DEN2_SHIFT)) & XBARA_CTRL1_DEN2_MASK)
#define XBARA_CTRL1_IEN2_MASK                    (0x2U)
#define XBARA_CTRL1_IEN2_SHIFT                   (1U)
/*! IEN2 - Interrupt Enable for XBAR_OUT2
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define XBARA_CTRL1_IEN2(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_IEN2_SHIFT)) & XBARA_CTRL1_IEN2_MASK)
#define XBARA_CTRL1_EDGE2_MASK                   (0xCU)
#define XBARA_CTRL1_EDGE2_SHIFT                  (2U)
/*! EDGE2 - Active edge for edge detection on XBAR_OUT2
 *  0b00..STS2 never asserts
 *  0b01..STS2 asserts on rising edges of XBAR_OUT2
 *  0b10..STS2 asserts on falling edges of XBAR_OUT2
 *  0b11..STS2 asserts on rising and falling edges of XBAR_OUT2
 */
#define XBARA_CTRL1_EDGE2(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_EDGE2_SHIFT)) & XBARA_CTRL1_EDGE2_MASK)
#define XBARA_CTRL1_STS2_MASK                    (0x10U)
#define XBARA_CTRL1_STS2_SHIFT                   (4U)
/*! STS2 - Edge detection status for XBAR_OUT2
 *  0b0..Active edge not yet detected on XBAR_OUT2
 *  0b1..Active edge detected on XBAR_OUT2
 */
#define XBARA_CTRL1_STS2(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_STS2_SHIFT)) & XBARA_CTRL1_STS2_MASK)
#define XBARA_CTRL1_DEN3_MASK                    (0x100U)
#define XBARA_CTRL1_DEN3_SHIFT                   (8U)
/*! DEN3 - DMA Enable for XBAR_OUT3
 *  0b0..DMA disabled
 *  0b1..DMA enabled
 */
#define XBARA_CTRL1_DEN3(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_DEN3_SHIFT)) & XBARA_CTRL1_DEN3_MASK)
#define XBARA_CTRL1_IEN3_MASK                    (0x200U)
#define XBARA_CTRL1_IEN3_SHIFT                   (9U)
/*! IEN3 - Interrupt Enable for XBAR_OUT3
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define XBARA_CTRL1_IEN3(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_IEN3_SHIFT)) & XBARA_CTRL1_IEN3_MASK)
#define XBARA_CTRL1_EDGE3_MASK                   (0xC00U)
#define XBARA_CTRL1_EDGE3_SHIFT                  (10U)
/*! EDGE3 - Active edge for edge detection on XBAR_OUT3
 *  0b00..STS3 never asserts
 *  0b01..STS3 asserts on rising edges of XBAR_OUT3
 *  0b10..STS3 asserts on falling edges of XBAR_OUT3
 *  0b11..STS3 asserts on rising and falling edges of XBAR_OUT3
 */
#define XBARA_CTRL1_EDGE3(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_EDGE3_SHIFT)) & XBARA_CTRL1_EDGE3_MASK)
#define XBARA_CTRL1_STS3_MASK                    (0x1000U)
#define XBARA_CTRL1_STS3_SHIFT                   (12U)
/*! STS3 - Edge detection status for XBAR_OUT3
 *  0b0..Active edge not yet detected on XBAR_OUT3
 *  0b1..Active edge detected on XBAR_OUT3
 */
#define XBARA_CTRL1_STS3(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL1_STS3_SHIFT)) & XBARA_CTRL1_STS3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XBARA_Register_Masks */


/* XBARA - Peripheral instance base addresses */
/** Peripheral XBARA base address */
#define XBARA_BASE                               (0x40059000u)
/** Peripheral XBARA base pointer */
#define XBARA                                    ((XBARA_Type *)XBARA_BASE)
/** Array initializer of XBARA peripheral base addresses */
#define XBARA_BASE_ADDRS                         { XBARA_BASE }
/** Array initializer of XBARA peripheral base pointers */
#define XBARA_BASE_PTRS                          { XBARA }
/** Interrupt vectors for the XBARA peripheral type */
#define XBARA_IRQS                               { XBARA_IRQn }

/*!
 * @}
 */ /* end of group XBARA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XBARB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Peripheral_Access_Layer XBARB Peripheral Access Layer
 * @{
 */

/** XBARB - Register Layout Typedef */
typedef struct {
  __IO uint16_t SEL0;                              /**< Crossbar B Select Register 0, offset: 0x0 */
  __IO uint16_t SEL1;                              /**< Crossbar B Select Register 1, offset: 0x2 */
  __IO uint16_t SEL2;                              /**< Crossbar B Select Register 2, offset: 0x4 */
  __IO uint16_t SEL3;                              /**< Crossbar B Select Register 3, offset: 0x6 */
  __IO uint16_t SEL4;                              /**< Crossbar B Select Register 4, offset: 0x8 */
  __IO uint16_t SEL5;                              /**< Crossbar B Select Register 5, offset: 0xA */
  __IO uint16_t SEL6;                              /**< Crossbar B Select Register 6, offset: 0xC */
  __IO uint16_t SEL7;                              /**< Crossbar B Select Register 7, offset: 0xE */
} XBARB_Type;

/* ----------------------------------------------------------------------------
   -- XBARB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Masks XBARB Register Masks
 * @{
 */

/*! @name SEL0 - Crossbar B Select Register 0 */
/*! @{ */
#define XBARB_SEL0_SEL0_MASK                     (0x3FU)
#define XBARB_SEL0_SEL0_SHIFT                    (0U)
/*! SEL0
 *  0b000000..CMP0 Output
 *  0b000001..CMP1 Output
 *  0b000010..CMP2 Output
 *  0b000011..CMP3 Output
 *  0b000100..FTM0 all channels match trigger ORed together
 *  0b000101..FTM0 counter init trigger
 *  0b000110..FTM3 all channels match trigger ORed together
 *  0b000111..FTM3 counter init trigger
 *  0b001000..PWMA channel 0 trigger 0
 *  0b001001..PWMA channel 1 trigger 0
 *  0b001010..PWMA channel 2 trigger 0
 *  0b001011..PWMA channel 3 trigger 0
 *  0b001100..PDB0 channel 0 output trigger
 *  0b001101..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b001110..XB_IN2 input pin
 *  0b001111..XB_IN3 input pin
 *  0b010000..FTM1 all channels match trigger ORed together
 *  0b010001..FTM1 counter init trigger
 *  0b010010..DMA channel 0 done
 *  0b010011..DMA channel 1 done
 *  0b010100..XB_IN10 input pin
 *  0b010101..XB_IN11 input pin
 *  0b010110..DMA channel 6 done
 *  0b010111..DMA channel 7 done
 *  0b011000..PIT trigger 0
 *  0b011001..PIT trigger 1
 *  0b011010..PDB1 channel 0 output trigger
 *  0b011011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b011100..PWMB channel 0 trigger 0 or trigger 1
 *  0b011101..PWMB channel 1 trigger 0 or trigger 1
 *  0b011110..PWMB channel 2 trigger 0 or trigger 1
 *  0b011111..PWMB channel 3 trigger 0 or trigger 1
 *  0b100000..FTM2 all channels match trigger ORed together
 *  0b100001..FTM2 counter init trigger
 *  0b100010..PDB0 channel 1 output trigger
 *  0b100011..PDB1 channel 1 output trigger
 *  0b100100..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100101..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100110..Analog-to-Digital Converter 0 conversion complete
 */
#define XBARB_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL0_SEL0_SHIFT)) & XBARB_SEL0_SEL0_MASK)
#define XBARB_SEL0_SEL1_MASK                     (0x3F00U)
#define XBARB_SEL0_SEL1_SHIFT                    (8U)
/*! SEL1
 *  0b000000..CMP0 Output
 *  0b000001..CMP1 Output
 *  0b000010..CMP2 Output
 *  0b000011..CMP3 Output
 *  0b000100..FTM0 all channels match trigger ORed together
 *  0b000101..FTM0 counter init trigger
 *  0b000110..FTM3 all channels match trigger ORed together
 *  0b000111..FTM3 counter init trigger
 *  0b001000..PWMA channel 0 trigger 0
 *  0b001001..PWMA channel 1 trigger 0
 *  0b001010..PWMA channel 2 trigger 0
 *  0b001011..PWMA channel 3 trigger 0
 *  0b001100..PDB0 channel 0 output trigger
 *  0b001101..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b001110..XB_IN2 input pin
 *  0b001111..XB_IN3 input pin
 *  0b010000..FTM1 all channels match trigger ORed together
 *  0b010001..FTM1 counter init trigger
 *  0b010010..DMA channel 0 done
 *  0b010011..DMA channel 1 done
 *  0b010100..XB_IN10 input pin
 *  0b010101..XB_IN11 input pin
 *  0b010110..DMA channel 6 done
 *  0b010111..DMA channel 7 done
 *  0b011000..PIT trigger 0
 *  0b011001..PIT trigger 1
 *  0b011010..PDB1 channel 0 output trigger
 *  0b011011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b011100..PWMB channel 0 trigger 0 or trigger 1
 *  0b011101..PWMB channel 1 trigger 0 or trigger 1
 *  0b011110..PWMB channel 2 trigger 0 or trigger 1
 *  0b011111..PWMB channel 3 trigger 0 or trigger 1
 *  0b100000..FTM2 all channels match trigger ORed together
 *  0b100001..FTM2 counter init trigger
 *  0b100010..PDB0 channel 1 output trigger
 *  0b100011..PDB1 channel 1 output trigger
 *  0b100100..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100101..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100110..Analog-to-Digital Converter 0 conversion complete
 */
#define XBARB_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL0_SEL1_SHIFT)) & XBARB_SEL0_SEL1_MASK)
/*! @} */

